package practic.dataOutput.task9;

public class main {
    public static void main(String[] args) {

        /**
         * Задача 9
         * Объявите переменную город типа String и присвойте ей название города.
         * Выведите на экран фразу "Местоположение:" и значение переменной город.
         */

        String nameSity = "Moscow";
        System.out.printf("My city is - %s%n", nameSity);

    }

}
