package practic.dataOutput.task7;

public class main {
    public static void main(String[] args) {

        /**
         * Задача 7
         * Объявите переменную bigNumber типа long и присвойте ей большое число. Выведите на экран это число.
         */

        long bigNumber = 2700000000000000L;
        System.out.printf("Очень большое число- %d , с ним справиться только тип long", bigNumber);

    }
}
