package practic.dataOutput.task8;

public class main {
    public static void main(String[] args) {

        /**
         * Задача 8
         * Объявите переменную дробь типа float и присвойте ей значение дробного числа. Выведите на экран это число с двумя знаками после запятой.
         */

        float numberfloat = 3.1415f;
        System.out.printf("Число pi = %.2f%n", numberfloat);
    }
}
