package practic.dataOutput.task5;

public class main {
    public static void main(String[] args) {

        /**
         * Задача 5
         * Объявите переменную символ типа char и присвойте ей любой символ.
         * Выведите на экран «(символ) – символ гордости!!».
         */

        char symbol = '$';
        System.out.printf("Символ гордости и достатка - %c", symbol);
    }
}
