package dataOutput.task2;

public class main {
    public static void main(String[] args) {
        /** Задача 2
         Объявите переменную число и присвойте ей значение 42. Выведите на экран фразу "Ответ на главный вопрос жизни,
         вселенной и всего такого:" и значение переменной число.
         */

        int number = 42;

        System.out.printf("Ответ на главный вопрос жизни, вселенной и всего такого %d", number);
    }

}
