package practic.dataOutput.task1;

public class main {

    public static void main(String[] args) {

        /** Напишите программу, которая выводит на экран фразу "Привет, мир!".*/

        System.out.println("Привет, мир!");
    }


}
