package practic.dataOutput.task10;

public class main {
    public static void main(String[] args) {

        /**
         * Задача 10
         * Объявите две переменные x и y типа int и присвойте им значения.
         * Выведите на экран x - y = разность этих двух чисел.
         */

        int x = 10;
        int y = 5;
        int result = x -y;
        System.out.printf("разность чисел %d - %d = %d%n",x,y,result);
    }
}
