package practic.dataOutput.task4;

public class main {
    public static void main(String[] args) {

        /**
         * Задача 4
         * Объявите переменные имя (тип String) и возраст (тип int) и присвойте им значения вашего выбора.
         *
         * Выведите на экран фразу, содержащую имя и возраст.
         */
        String name = "Саша";
        int age = 20;

        System.out.printf("Привет, меня зовут %s, мне %d лет", name, age);



    }

}
